#include <iostream>

// Функция, которую контролирует или может вызывать хакер.
// Она просто записывает в стек "нужные" хакеру данные.
void hacker_function() {
    int trap = 1337; 
    std::cout << "[Hacker] Оставил в памяти (на стеке) число: " << trap << std::endl;
}

// Уязвимая функция
void secure_function(bool condition) {
    int b; // Переменная НЕ инициализирована!
    
    if (condition) {
        b = 1; // Сюда мы НЕ зайдем, если condition == false
    }

    // Опасность! Читаем неинициализированную переменную
    std::cout << "[Target] Значение переменной b: " << b << std::endl;

    if (b == 1337) {
        std::cout << "[!!!] Взлом успешен! Доступ к секретным функциям открыт." << std::endl;
    }
}

int main() {
    // 1. Сначала вызывается функция, которая оставляет "грязный" след на стеке
    hacker_function();

    // 2. Затем вызывается уязвимая функция с условием false
    secure_function(false);

    return 0;
}

